КАКерамика_моя_старая_база/src/Documents/КонтурЛогистика_ЗН_Титул4/КонтурЛогистика_ЗН_Титул4.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КонтурЛогистика_ЗН_Титул4</name>
  <posting>Deny</posting>
  <attributes>
    <name>УИД_ЗН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.КонтурЛогистика_ДокументыУчетнойСистемы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументЗН</name>
    <comment>Главный документ для ЗН</comment>
    <type>
      <types>DocumentRef.КонтурЛогистика_ЭлектронныйЗаказНаряд</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИспр</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомИспр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатИнфФщ</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВрИнфФщ</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатФайлИнфФт</name>
    <comment>Дата формирования файла обмена информации Фрахтователя</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВрФайлИнфФт</name>
    <comment>Время формирования файла обмена информации Фрахтователя</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдФайлИнфФт</name>
    <comment>Идентификатор файла обмена информации Фрахтователя</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭПФт</name>
    <comment>Электронная подпись файла обмена информации Фрахтователя</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатВрЗавПолТС</name>
    <comment>Фактические дата и время завершения пользования транспортным средством</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзмДатВрВыпПрвз</name>
    <comment>Изменение даты и времени выполнения перевозки</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзмСрокВыпПрвз</name>
    <comment>Изменение сроков выполнения перевозки</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИзмМршВыпПрвз</name>
    <comment>Изменение маршрута выполнения перевозки</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательПодписант</name>
    <type>
      <types>DefinedType.КонтурЛогистика_Пользователи1С</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрНастроекПодписания</name>
    <comment>Параметр используется для поиска подписанта по дополнительному параметру</comment>
    <type>
      <types>DefinedType.КонтурЛогистика_ЗначениеНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>будет отображаться только в диадоке, не попадет в ЭтРН</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтметкиФрахтовщика</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаИВремяОтметки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеОбстоятельств</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Акты</name>
    <attributes>
      <name>ИдентификаторСтрокиОтметки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АктЭтоАктВзвешивания</name>
      <comment>Если истина - то будет отправелен в СвАктВзв. Если ложь - в СвАкт</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>АктНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АктДата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АктНаименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АктИдДок</name>
      <comment>Идентификатор файла документа (в том числе регистрационный номер, если документ / сведения о таком документе содержатся в государственных информационных системах)</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АктДопСведДок</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СтороныСоставители</name>
      <type>
        <types>EnumRef.КонтурЛогистика_СтороныСоставители</types>
      </type>
    </attributes>
    <attributes>
      <name>ДополнительныйСоставитель</name>
      <type>
        <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Штрафы</name>
    <attributes>
      <name>ИдентификаторСтрокиОтметки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактКолЕдИзм</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИтогРазмШтрРФ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РасчШтр</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИнфПол</name>
    <comment>Информационные поля</comment>
    <attributes>
      <name>ИдентификаторСтрокиОтметки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Идентиф</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсправлениеФИОЛиц</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.КонтурЛогистика_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Фамилия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>60</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>60</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отчество</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>60</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

КАКерамика_моя_старая_база/src/InformationRegisters/КонтурЛогистика_СтатусыТитулов/КонтурЛогистика_СтатусыТитулов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтурЛогистика_СтатусыТитулов</name>
  <comment>Время по МСК!</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СтатусыТитулов</types>
    </type>
  </resources>
  <resources>
    <name>СтатусПодписи</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СтатусыПодписи</types>
    </type>
  </resources>
  <resources>
    <name>ТипОшибки</name>
    <type>
      <types>EnumRef.КонтурЛогистика_ТипыОшибокСтатусаТитула</types>
    </type>
  </resources>
  <resources>
    <name>КодОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОписаниеОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоОшибок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Пользователь1С</name>
    <type>
      <types>DefinedType.КонтурЛогистика_Пользователи1С</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодробноеОписаниеОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_СВ_ТитулГП</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул4</types>
      <types>DocumentRef.КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут</types>
      <types>DocumentRef.КонтурЛогистика_ЗН_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул2_5_02</types>
      <types>DocumentRef.КонтурЛогистика_СВ_ТитулГО</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул4</types>
      <types>DocumentRef.КонтурЛогистика_ПЭ_Титул2</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул3</types>
      <types>DocumentRef.КонтурЛогистика_ДФ_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ЭкспедиторскаяРасписка</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул5</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул5_5_02</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул7</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул1_5_02</types>
      <types>DocumentRef.КонтурЛогистика_ЗН_Титул3</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул4_5_02</types>
      <types>DocumentRef.КонтурЛогистика_ЗЗ_Титул2</types>
      <types>DocumentRef.КонтурЛогистика_ПЭ_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ЗН_Титул2</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул6</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул5</types>
      <types>DocumentRef.КонтурЛогистика_ЗЗ_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул8</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул3</types>
      <types>DocumentRef.КонтурЛогистика_ЗН_Титул4</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул3_5_02</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул2</types>
      <types>DocumentRef.КонтурЛогистика_СкладскаяРасписка</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул2</types>
      <types>DocumentRef.КонтурЛогистика_СВ_ТитулПВ</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул6</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

КАКерамика_моя_старая_база/src/Documents/КонтурЛогистика_ЗН_Титул4/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Подключаемый модуль (ПМ)
	ПараметрыПМ = Новый Структура("ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения", ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	КонтурЛогистика_ПодключаемыйМодульВызов.ОбработкаСобытияПодключаемогоМодуля("ЗН_Титул4_ПередЗаписью_После", Истина, ПараметрыПМ);
	Отказ = ?(Отказ <> ПараметрыПМ.Отказ, ПараметрыПМ.Отказ, Отказ);	// Если признак отказа был изменен в ПМ, то пробрасываем его значение
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	РегистрыСведений.КонтурЛогистика_СтатусыТитулов.УстановитьЧерновикДляНовогоДокумента(Ссылка);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения <> Неопределено 
		И ТипЗнч(ДанныеЗаполнения) = Тип("Структура") 
		И ДанныеЗаполнения.Свойство("ДокументОснование")
		И ЗначениеЗаполнено(ДанныеЗаполнения.ДокументОснование) Тогда
		
		ЗаполнитьПоДокОснованию(ДанныеЗаполнения);
		ЗаполнитьРеквизитыПоПользователю();
		
	ИначеЕсли ДанныеЗаполнения <> Неопределено 
		И ТипЗнч(ДанныеЗаполнения) = Тип("Структура") 
		И ДанныеЗаполнения.Свойство("ПредыдущийТитул")
		И ЗначениеЗаполнено(ДанныеЗаполнения.ПредыдущийТитул) Тогда
		
		ЗаполнитьПоПредыдущемуТитулу(ДанныеЗаполнения);
		ЗаполнитьРеквизитыПоПользователю();
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.КонтурЛогистика_ФайлыОбмена") Тогда
		
		ФайлСсылка = ДанныеЗаполнения;
		ТекстФайла = ФайлСсылка.ТекстXML.Получить();
		Если СокрЛП(ТекстФайла) = "" Тогда 
			Сообщить("По файлу " + ФайлСсылка + " нет текста титула");
			Возврат;
		КонецЕсли;

		ЗаполнитьИзФайлаОбмена(ТекстФайла, ФайлСсылка);

	КонецЕсли;
	
	// ПМ на изменение документа
	КонтурЛогистика_ПодключаемыйМодульВызов.ОбработкаСобытияПодключаемогоМодуля(
		"ЗН_Титул4_ОбработкаЗаполнения_После",
		Истина,
		ЭтотОбъект);
	
КонецПроцедуры

//////////////////////////////////////////////////////////////////
// Из док Основания

Процедура ЗаполнитьПоДокОснованию(Знач ДанныеЗаполнения)
	
	// не реализовано
	
КонецПроцедуры

Процедура ЗаполнитьРеквизитыПоПользователю() Экспорт
	
	Попытка
		
		// Поиск подписанта в настройках подписания по дополнительному параметру.
		Если Не ЗначениеЗаполнено(ПользовательПодписант) И ЗначениеЗаполнено(ПараметрНастроекПодписания) Тогда
			ДанныеПодписанта = РегистрыСведений.КонтурЛогистика_НастройкиПодписания.ВыбратьПодписанта(
				ДокументЗН.Фрахтовщик,,, ЭтотОбъект, ПараметрНастроекПодписания);
			
			ПользовательПодписант = ДанныеПодписанта.Пользователь1С;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ПользовательПодписант) Тогда 
			ПользовательПодписант = ПараметрыСеанса.ТекущийПользователь;
		КонецЕсли;
		
		// TODO дефолты, зависящие от Пользователя
		
	Исключение
		
		КонтурЛогистика_Метрика.ОбработатьОшибку("ЗаполнитьРеквизитыПоПользователю", ОписаниеОшибки());

	КонецПопытки;
	
КонецПроцедуры

//////////////////////////////////////////////////////////////////
// Из пришедшего файла XML

Процедура ЗаполнитьИзФайлаОбмена(Знач ТекстФайла, Знач ФайлСсылка)
	
	НайденныйГлавный = КонтурЛогистика_ОбработкаДокументовСервер.НайтиГлавныйДокументПоФайлу(ФайлСсылка);
	
	Если Не ЗначениеЗаполнено(НайденныйГлавный) Тогда 
		
		Сообщить("При создании титула по файлу " + ФайлСсылка + "не смог найти главный Документ, создание не выполнено");
		
	Иначе
		
		ЭтотОбъект.ДокументЗН = НайденныйГлавный;
		XDTO = КонтурЛогистика_КонструкторыXDTO.ПолучитьXDTOпоXML(ТекстФайла);
		СодЗНИнфФщ = XDTO.Документ.СодЗНИнфФщ;
		
		ЗаполнитьРеквизитыТитулаИзXDTO(XDTO, СодЗНИнфФщ);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьРеквизитыТитулаИзXDTO(Знач XDTO, СодЗНИнфФщ)
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	Документ 		= КС.XDTO_Вычислить(XDTO, "Документ");
	
	УИД_ЗН 			= КС.XDTO_Вычислить(СодЗНИнфФщ, "УИД_ЗН");
	
	ДатИнфФщ 	= КС.Конвертировать_ДатаТип_вДата(КС.XDTO_Вычислить(Документ, "ДатИнфФщ"));
	ВрИнфФщ 	= КС.Конвертировать_ВремяТип_вДата(КС.XDTO_Вычислить(Документ, "ВрИнфФщ"));
	
	ДатФайлИнфФт 	= КС.Конвертировать_ДатаТип_вДата(КС.XDTO_Вычислить(Документ, "ИдИнфФт.ДатФайлИнфФт"));
	ВрФайлИнфФт 	= КС.Конвертировать_ВремяТип_вДата(КС.XDTO_Вычислить(Документ, "ИдИнфФт.ВрФайлИнфФт"));
	ИдФайлИнфФт 	= КС.XDTO_Вычислить(Документ, "ИдИнфФт.ИдФайлИнфФт");
	
	ЭПФт = КС.XDTO_Вычислить(Документ, "ИдИнфФт.ЭП");

	ДатВрЗавПолТС  	= КС.Конвертировать_ДатаВремяВЗТип_вДатаВремяМСК(КС.XDTO_Вычислить(СодЗНИнфФщ, "ДатВрЗавПолТС"));
	
	КС.ЗаполнитьИсправления_ЗН(ЭтотОбъект, СодЗНИнфФщ);

	ЗаполнитьОтметки(СодЗНИнфФщ);
	
	СвОгЗамФщ = КС.XDTO_Вычислить(СодЗНИнфФщ, "СвОгЗамФщ");
	Если СвОгЗамФщ <> Неопределено Тогда 
		ИзмДатВрВыпПрвз = КС.Конвертировать_ДатаВремяВЗТип_вДатаВремяМСК(КС.XDTO_Вычислить(СвОгЗамФщ, "ИзмДатВрВыпПрвз"));
		ИзмСрокВыпПрвз  = КС.XDTO_Вычислить(СвОгЗамФщ, "ИзмСрокВыпПрвз");
		ИзмМршВыпПрвз   = КС.XDTO_Вычислить(СвОгЗамФщ, "ИзмМршВыпПрвз");
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьОтметки(СодЗНИнфФщ)
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	ОтметкиФрахтовщика.Очистить();
	
	XDTO_Отмет				= КС.XDTO_ВычислитьМассивXDTO(КС.XDTO_Вычислить(СодЗНИнфФщ, "ОтметФщ"));
	
	Для Каждого XDTO_Отметка Из XDTO_Отмет Цикл 
		
		НоваяСтрокаОтметкиГрузополучателя = ОтметкиФрахтовщика.Добавить();
		
		КС.ЗаполнитьСтрокуОтметкиИзXDTO(XDTO_Отметка, НоваяСтрокаОтметкиГрузополучателя, ЭтотОбъект);
		
	КонецЦикла;

КонецПроцедуры

//////////////////////////////////////////////////////////////////
// Из предыдущего титула

Процедура ЗаполнитьПоПредыдущемуТитулу(Знач ДанныеЗаполнения)
	
	ПредыдущийТитул = ДанныеЗаполнения.ПредыдущийТитул;
	
	КонтекстНастройкиКонвертации = КонтурЛогистика_КонвертацияСерверПовтИсп.КонтекстНастройкиКонвертацииУчетногоДокумента(
		ДанныеЗаполнения.ТипЛогистика);
	
	УИД_ЗН 		= ПредыдущийТитул.УИД_ЗН;
	Если Не ЗначениеЗаполнено(УИД_ЗН) Тогда 
		УИД_ЗН = "Отсутствует";
	КонецЕсли;
	ДокументЗН 	= ПредыдущийТитул.ДокументЗН;
	
	ЗаполнитьУказателиНаПредыдущийТитул(ПредыдущийТитул);
		
	// Ищем титул1 - оттуда нужны товары и некоторые итоговые реквизиты
	
	ЗаполнитьЧерезНастройкиКонвертации(КонтекстНастройкиКонвертации);
	
КонецПроцедуры

Процедура ЗаполнитьУказателиНаПредыдущийТитул(Знач ПредыдущийТитул) Экспорт
	
	Перем ДвоичныеДанныеПодписи, ФайлТитула3;
	
	ФайлТитула3 = Справочники.КонтурЛогистика_ФайлыОбмена.КрайнийФайлДокумента(ПредыдущийТитул);
	
	ЭтотОбъект.ДатФайлИнфФт 	= ПредыдущийТитул.ДатИнфФт;
	ЭтотОбъект.ВрФайлИнфФт  	= ПредыдущийТитул.ВрИнфФт;
	ЭтотОбъект.ИдФайлИнфФт 	= СтрЗаменить(ФайлТитула3.ИмяФайла, ".xml", "");
	
	ДвоичныеДанныеПодписи = ФайлТитула3.Подпись.Получить();
	ЭтотОбъект.ЭПФт 				= Base64Строка(ДвоичныеДанныеПодписи);

КонецПроцедуры

Процедура ЗаполнитьЧерезНастройкиКонвертации(КонтекстНастройкиКонвертации)
	
	Если КонтекстНастройкиКонвертации.ЕстьКонвертация Тогда
		КонтурЛогистика_ОбработкаДокументовСервер.ЗаполнитьДокументТитулПоДокументуУчетнойСистемы(
			ЭтотОбъект, КонтекстНастройкиКонвертации);
	КонецЕсли;
	
КонецПроцедуры

//////////////////////////////////////////////////////////////////
// Генерация xml

Функция СформироватьФайлОбмена(ПараметрыФайлаРеквизиты = Неопределено) Экспорт

	Результат = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИнициализироватьСтруктуруРезультатаФункции();
	Результат.Вставить("МассивФайловОбмена", Новый Массив);
	Результат.Успешно = Истина;
	
	Попытка
	
		Заблокировать();
	
	Исключение
		
		Результат.Успешно = Ложь;
	    Результат.ОписаниеОшибки = "Не удалось заблокировать документ: " + ОписаниеОшибки();
		Возврат Результат;
		
	КонецПопытки;
	
	// Проверка статуса после наложения блокировки на Документ
	РезультатПроверкиСтатуса = КонтурЛогистика_ОбработкаДокументовСервер.ПроверитьТекущийСтатусДокументаДляСозданияФайловОбмена(Ссылка);
	
	Если НЕ РезультатПроверкиСтатуса.Успешно Тогда
		Разблокировать();
		Возврат РезультатПроверкиСтатуса;
	КонецЕсли;
	
	// Выполнить валидацию документа
	РезультатВалидации = Документы.КонтурЛогистика_ЗН_Титул4.ПроверитьДокумент(Ссылка);
	
	Если РезультатВалидации.КоличествоОшибок > 0 Тогда
		
		Разблокировать();
		Результат.ОписаниеОшибки = "Ошибки в " + Ссылка + "! Исправьте их для отправки.";
		Результат.Успешно = Ложь;
		Возврат Результат;
		
	КонецЕсли;
	
	КонтурЛогистика_ОбщегоНазначенияСервер.НачатьТранзакцию_();
	
	ЭтотОбъект.ДатИнфФщ = ТекущаяДатаСеанса();
	ЭтотОбъект.ВрИнфФщ = ТекущаяДатаСеанса();
	
	Попытка
		
		// формируем текст xml
		РезультатФормированияТекста = СформироватьТекстФайла(ЭтотОбъект.ДатИнфФщ, ЭтотОбъект.ВрИнфФщ);
		Если РезультатФормированияТекста.Успешно = Ложь Тогда
					
			Результат.Успешно = Ложь;
			Результат.МассивОшибок.Добавить(КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СформироватьТекстОшибокФункции(РезультатФормированияТекста));
			Возврат Результат;
					
		КонецЕсли;
		
		// запишем в справочник
		РезультатСозданияФайла = Справочники.КонтурЛогистика_ФайлыОбмена.СоздатьФайлОбмена(
										РезультатФормированияТекста,
										Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЗН_Титул4,
										ПараметрыФайлаРеквизиты,
										Ссылка);
				
		ЗаполнитьЗначенияСвойств(Результат, РезультатСозданияФайла);
		
		Если Результат.Успешно Тогда
			
			РегистрыСведений.КонтурЛогистика_СтатусыТитулов.УстановитьСтатус(Ссылка, 
				Перечисления.КонтурЛогистика_СтатусыТитулов.СформированыФайлыОбмена, , Истина);
			
			Результат.МассивФайловОбмена.Добавить(РезультатСозданияФайла.Файл);
			
		Иначе
			
			ВызватьИсключение КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СформироватьТекстОшибокФункции(Результат);
			
		КонецЕсли;
		
		Записать(); // запишем  ДатИнфФщ и ВрИнфФщ
		
		Разблокировать();
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ТекстОшибки = "Ошибка при формировании файла обмена по документу " + Ссылка + ": " + ОписаниеОшибки();
		Сообщить(ТекстОшибки);
		Разблокировать();
		Результат.Успешно = Ложь;
		Результат.Массивошибок.Добавить(ТекстОшибки);
		
		КонтекстМетода = Новый Структура;
		КонтекстМетода.Вставить("ПараметрыФайлаРеквизиты", ПараметрыФайлаРеквизиты);
		КонтекстМетода.Вставить("РезультатСозданияФайла", РезультатСозданияФайла);
		
		КонтурЛогистика_Метрика.ОбработатьОшибкуФормированияТекстаФайла(Ссылка, ИнформацияОбОшибке(), КонтекстМетода);
		
	КонецПопытки;
	
	Возврат Результат;
		
		
КонецФункции 

Функция СформироватьТекстФайла(ДатаФормирования, ВремяФормирования)
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	ТипДокументооборота = "__zakazNarTitle";
	
	Результат = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИнициализироватьСтруктуруРезультатаФункции();
	Результат.Вставить("ТекстФайла", "");
	
	XDTO_Файл = КС.XDTO_ФайлОбмена(4, , ТипДокументооборота);
	
	GUID = Строка(Новый УникальныйИдентификатор);
	
	XDTO_Файл.ИдФайл = КС.ИдентификаторФайлаТитулаЗН(4, 
												ДокументЗН.Фрахтователь,
												ДокументЗН.Фрахтовщик,
												GUID); 
	Результат.Вставить("ИдФайл",		XDTO_Файл.ИдФайл);
	
	ПодписантСтруктура 	= РегистрыСведений.КонтурЛогистика_НастройкиПодписания.ВыбратьПодписанта(
		ДокументЗН.Фрахтовщик, ПользовательПодписант, Неопределено, ЭтотОбъект, ПараметрНастроекПодписания);
	XDTO_Подписант 		= КС.XDTO_Подписант(4, ТипДокументооборота, , ПодписантСтруктура, неопределено); // TODO МЧД
	
	XDTO_Файл.Документ	= КС.XDTO_Документ(4, ТипДокументооборота, , XDTO_Подписант, ДатаФормирования, ВремяФормирования);

	XDTO_СодЗНИнфФщ = КС.XDTO_СодЗНИнфФщ_Т4(4, , Ссылка);
	КС.XDTO_Установить(XDTO_Файл.Документ, "СодЗНИнфФщ", XDTO_СодЗНИнфФщ);

	XDTO_ИдИнфФт 		= КС.XDTO_ИдИнфФт(4, , Ссылка);
	КС.XDTO_Установить(XDTO_Файл.Документ, "ИдИнфФт", XDTO_ИдИнфФт);
	
	ТекстФайла = КонтурЛогистика_КонструкторыXDTO.ПодготовитьТекстФайлаЛогистика(XDTO_Файл);
	
	Результат.Вставить("ТекстФайла", ТекстФайла);
	Результат.Вставить("GUID",		GUID);
	
	Результат.Успешно = Истина;
	
	Возврат Результат;
	
КонецФункции

#КонецЕсли
